In [11]:
import pandas as pd

In [12]:
grades_dict = {
    'W': [65, 96, 87],
    'E': [100, 87, 90],
    'S': [94, 77, 90],
    'K': [98, 76, 52],
    'B': [78, 74, 82],
}

In [3]:
grades = pd.DataFrame(grades_dict)

In [13]:
grades.index = ['Test1','Test2','Test3']

In [14]:
grades

        W    E   S   K   B
Test1  65  100  94  98  78
Test2  96   87  77  76  74
Test3  87   90  90  52  82

In [15]:
grades.describe()

           W       E      S      K     B
count   3.00    3.00   3.00   3.00   3.0
mean   82.67   92.33  87.00  75.33  78.0
std    15.95    6.81   8.89  23.01   4.0
min    65.00   87.00  77.00  52.00  74.0
25%    76.00   88.50  83.50  64.00  76.0
50%    87.00   90.00  90.00  76.00  78.0
75%    91.50   95.00  92.00  87.00  80.0
max    96.00  100.00  94.00  98.00  82.0

In [16]:
# formatting to two digits
pd.set_option('precision', 2)

In [17]:
grades.describe()

           W       E      S      K     B
count   3.00    3.00   3.00   3.00   3.0
mean   82.67   92.33  87.00  75.33  78.0
std    15.95    6.81   8.89  23.01   4.0
min    65.00   87.00  77.00  52.00  74.0
25%    76.00   88.50  83.50  64.00  76.0
50%    87.00   90.00  90.00  76.00  78.0
75%    91.50   95.00  92.00  87.00  80.0
max    96.00  100.00  94.00  98.00  82.0

In [18]:
grades.mean()

W    82.67
E    92.33
S    87.00
K    75.33
B    78.00
dtype: float64

In [19]:
grades.count()

W    3
E    3
S    3
K    3
B    3
dtype: int64

In [20]:
# Trasposing dataframe
grades.T

   Test1  Test2  Test3
W     65     96     87
E    100     87     90
S     94     77     90
K     98     76     52
B     78     74     82

In [21]:
grades.T.describe()

        Test1  Test2  Test3
count    5.00    5.0    5.0
mean    87.00   82.0   80.2
std     15.03    9.3   16.1
min     65.00   74.0   52.0
25%     78.00   76.0   82.0
50%     94.00   77.0   87.0
75%     98.00   87.0   90.0
max    100.00   96.0   90.0

In [22]:
#sortin data frames - descending index
grades.sort_index(ascending=False)

        W    E   S   K   B
Test3  87   90  90  52  82
Test2  96   87  77  76  74
Test1  65  100  94  98  78

In [23]:
# sort with columns - by default it is axis 0
grades.sort_index(axis=1)

        B    E   K   S   W
Test1  78  100  98  94  65
Test2  74   87  76  77  96
Test3  82   90  52  90  87

In [24]:
#sort with Values. e.g Test1 which student performed best
grades.sort_values(by='Test1', axis=1, ascending=False)
# E (Eva) performed best for Test1.

         E   K   S   B   W
Test1  100  98  94  78  65
Test2   87  76  77  74  96
Test3   90  52  90  82  87

In [25]:
# you may do this for Test2
grades.sort_values(by='Test2', axis=1, ascending=False)
# W (Wally) was best for Test2

        W    E   S   K   B
Test1  65  100  94  98  78
Test2  96   87  77  76  74
Test3  87   90  90  52  82

In [26]:
# same thing on Transposed data frame. This time we are not giving axis as with Transposed columns became index(axis0)
grades.T.sort_values(by='Test2', ascending=False)

   Test1  Test2  Test3
W     65     96     87
E    100     87     90
S     94     77     90
K     98     76     52
B     78     74     82

In [27]:
# you may take the data out for Test2 first and then sort
# in that case you get the series back
# gives back new dataframe.
# if you want to modify the dataframe with sorted data, then use inplace=True argument to sort.
grades.loc['Test2'].sort_values(ascending=False)

W    96
E    87
S    77
K    76
B    74
Name: Test2, dtype: int64

In [28]:
# Exercise
temps = {'Mon': [68, 89], 'Tue': [71, 93], 'Wed': [66, 82], 'Thu': [75, 97], 'Fri': [62, 79]}

In [31]:
#converting temps to data frame with low and high as indices
temperatures = pd.DataFrame(temps, index=['Low', 'High'])

In [32]:
temperatures

      Mon  Tue  Wed  Thu  Fri
Low    68   71   66   75   62
High   89   93   82   97   79

In [38]:
# Select only Mon Through Wed columns
temperatures[['Mon', 'Tue', 'Wed', 'Thu']]

      Mon  Tue  Wed  Thu
Low    68   71   66   75
High   89   93   82   97

In [45]:
# Select only Mon Through Wed columns using loc attribute
temperatures.loc[:, 'Mon':'Thu']

      Mon  Tue  Wed  Thu
Low    68   71   66   75
High   89   93   82   97

In [39]:
# use row index 'Low' to select only low temperatures
temperatures.loc['Low']

Mon    68
Tue    71
Wed    66
Thu    75
Fri    62
Name: Low, dtype: int64

In [42]:
# set floating point precision to 3
pd.set_option('precision', 3)

In [44]:
# calculate average temperatuer for each day
temperatures.mean()

Mon    78.5
Tue    82.0
Wed    74.0
Thu    86.0
Fri    70.5
dtype: float64

In [47]:
# calculate average low and high temperature
temperatures.mean(axis=1)

Low     68.4
High    88.0
dtype: float64